# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
import pandas as pd
import sqlite3

In [2]:
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Write an Equivalent Query using a Subquery

```SQL
SELECT customerNumber,
       contactLastName,
       contactFirstName
       FROM customers
       JOIN orders 
       USING(customerNumber)
       WHERE orderDate = '2003-01-31';
```

In [4]:
cur.execute("""SELECT customerNumber, contactLastName, contactFirstName
               FROM customers
               WHERE customerNumber IN (SELECT customerNumber
                                        FROM orders
                                        WHERE orderDate = '2003-01-31')""").fetchall()

[(141, 'Freyre', 'Diego ')]

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [6]:
cur.execute("""SELECT productName, SUM(quantityOrdered) AS sum
               FROM products
               JOIN orderdetails
               USING(productCode)
               GROUP BY productName""").fetchall()

[('18th Century Vintage Horse Carriage', 907),
 ('18th century schooner', 1011),
 ('1900s Vintage Bi-Plane', 940),
 ('1900s Vintage Tri-Plane', 1009),
 ('1903 Ford Model A', 883),
 ('1904 Buick Runabout', 990),
 ('1911 Ford Town Car', 832),
 ('1912 Ford Model T Delivery Wagon', 991),
 ('1913 Ford Model T Speedster', 1038),
 ('1917 Grand Touring Sedan', 918),
 ('1917 Maxwell Touring Car', 992),
 ('1926 Ford Fire Engine', 998),
 ('1928 British Royal Navy Airplane', 972),
 ('1928 Ford Phaeton Deluxe', 972),
 ('1928 Mercedes-Benz SSK', 880),
 ('1930 Buick Marquette Phaeton', 1074),
 ('1932 Alfa Romeo 8C2300 Spider Sport', 866),
 ('1932 Model A Ford J-Coupe', 957),
 ('1934 Ford V8 Coupe', 985),
 ('1936 Chrysler Airflow', 983),
 ('1936 Harley Davidson El Knucklehead', 945),
 ('1936 Mercedes Benz 500k Roadster', 824),
 ('1936 Mercedes-Benz 500K Special Roadster', 960),
 ('1937 Horch 930V Limousine', 884),
 ('1937 Lincoln Berline', 1111),
 ('1938 Cadillac V-16 Presidential Limousine', 955),
 ('1939 Cadillac Limousine', 995),
 ('1939 Chevrolet Deluxe Coupe', 937),
 ('1940 Ford Delivery Sedan', 923),
 ('1940 Ford Pickup Truck', 999),
 ('1940s Ford truck', 1061),
 ('1941 Chevrolet Special Deluxe Cabriolet', 1076),
 ('1948 Porsche 356-A Roadster', 972),
 ('1948 Porsche Type 356 Roadster', 948),
 ('1949 Jaguar XK 120', 949),
 ("1950's Chicago Surface Lines Streetcar", 934),
 ('1952 Alpine Renault 1300', 961),
 ('1952 Citroen-15CV', 873),
 ('1954 Greyhound Scenicruiser', 955),
 ('1956 Porsche 356A Coupe', 1052),
 ('1957 Chevy Pickup', 1056),
 ('1957 Corvette Convertible', 1013),
 ('1957 Ford Thunderbird', 767),
 ('1957 Vespa GS150', 959),
 ('1958 Chevy Corvette Limited Edition', 983),
 ('1958 Setra Bus', 972),
 ('1960 BSA Gold Star DBD34', 1015),
 ('1961 Chevrolet Impala', 941),
 ('1962 City of Detroit Streetcar', 966),
 ('1962 LanciaA Delta 16V', 932),
 ('1962 Volkswagen Microbus', 1029),
 ('1964 Mercedes Tour Bus', 1053),
 ('1965 Aston Martin DB5', 914),
 ('1966 Shelby Cobra 427 S/C', 915),
 ('1968 Dodge Charger', 925),
 ('1968 Ford Mustang', 933),
 ('1969 Chevrolet Camaro Z28', 870),
 ('1969 Corvair Monza', 963),
 ('1969 Dodge Charger', 992),
 ('1969 Dodge Super Bee', 974),
 ('1969 Ford Falcon', 965),
 ('1969 Harley Davidson Ultimate Chopper', 1057),
 ('1970 Chevy Chevelle SS 454', 803),
 ('1970 Dodge Coronet', 976),
 ('1970 Plymouth Hemi Cuda', 900),
 ('1970 Triumph Spitfire', 945),
 ('1971 Alpine Renault 1600s', 969),
 ('1972 Alfa Romeo GTA', 1030),
 ('1974 Ducati 350 Mk3 Desmo', 898),
 ('1976 Ford Gran Torino', 915),
 ('1980s Black Hawk Helicopter', 1040),
 ('1980’s GM Manhattan Express', 911),
 ('1982 Camaro Z28', 997),
 ('1982 Ducati 900 Monster', 947),
 ('1982 Ducati 996 R', 906),
 ('1982 Lamborghini Diablo', 912),
 ('1992 Ferrari 360 Spider red', 1808),
 ('1992 Porsche Cayenne Turbo Silver', 867),
 ('1993 Mazda RX-7', 947),
 ('1995 Honda Civic', 917),
 ('1996 Moto Guzzi 1100i', 999),
 ('1996 Peterbilt 379 Stake Bed with Outrigger', 988),
 ('1997 BMW F650 ST', 1014),
 ('1997 BMW R 1100 S', 1033),
 ('1998 Chrysler Plymouth Prowler', 986),
 ('1999 Indy 500 Monte Carlo SS', 855),
 ('1999 Yamaha Speed Boat', 966),
 ('2001 Ferrari Enzo', 1019),
 ('2002 Chevy Corvette', 894),
 ('2002 Suzuki XREO', 1028),
 ('2002 Yamaha YZR M1', 992),
 ('2003 Harley-Davidson Eagle Drag Bike', 985),
 ('ATA: B757-300', 973),
 ('America West Airlines B757-200', 984),
 ('American Airlines: B767-300', 894),
 ('American Airlines: MD-11S', 1085),
 ('Boeing X-32A JSF', 960),
 ('Collectable Wooden Train', 918),
 ('Corsair F4U ( Bird Cage)', 1051),
 ('Diamond T620 Semi-Skirted Tanker', 979),
 ('F/A 18 Hornet 1/72', 1047),
 ('HMS Bounty', 897),
 ('P-51-D Mustang', 917),
 ('Pont Yacht', 958),
 ('The Mayflower', 898),
 ('The Queen Mary', 896),
 ('The Schooner Bluenose', 934),
 ('The Titanic', 952),
 ('The USS Constitution Ship', 1020)]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [9]:
cur.execute("""SELECT productName, COUNT(DISTINCT customerNumber) AS numPurchasers
               FROM products
               JOIN orderdetails
               USING(productCode)
               JOIN orders
               USING(orderNumber)
               GROUP BY productName
               ORDER BY numPurchasers DESC""").fetchall()

[('1992 Ferrari 360 Spider red', 40),
 ('Boeing X-32A JSF', 27),
 ('1972 Alfa Romeo GTA', 27),
 ('1952 Alpine Renault 1300', 27),
 ('1934 Ford V8 Coupe', 27),
 ('HMS Bounty', 26),
 ('Corsair F4U ( Bird Cage)', 26),
 ('American Airlines: MD-11S', 26),
 ('1999 Yamaha Speed Boat', 26),
 ('1996 Moto Guzzi 1100i', 26),
 ('1995 Honda Civic', 26),
 ('1980s Black Hawk Helicopter', 26),
 ('1969 Harley Davidson Ultimate Chopper', 26),
 ('1941 Chevrolet Special Deluxe Cabriolet', 26),
 ('1940 Ford Delivery Sedan', 26),
 ('1937 Horch 930V Limousine', 26),
 ('1913 Ford Model T Speedster', 26),
 ('1900s Vintage Bi-Plane', 26),
 ('18th Century Vintage Horse Carriage', 26),
 ('America West Airlines B757-200', 25),
 ('ATA: B757-300', 25),
 ('2003 Harley-Davidson Eagle Drag Bike', 25),
 ('2002 Suzuki XREO', 25),
 ('1997 BMW R 1100 S', 25),
 ('1993 Mazda RX-7', 25),
 ('1962 LanciaA Delta 16V', 25),
 ('1960 BSA Gold Star DBD34', 25),
 ('1948 Porsche 356-A Roadster', 25),
 ('1940s Ford truck', 25),
 ('1940 Ford Pickup Truck', 25),
 ('1937 Lincoln Berline', 25),
 ('1936 Mercedes-Benz 500K Special Roadster', 25),
 ('1936 Harley Davidson El Knucklehead', 25),
 ('1912 Ford Model T Delivery Wagon', 25),
 ('The Queen Mary', 24),
 ('Pont Yacht', 24),
 ('P-51-D Mustang', 24),
 ('F/A 18 Hornet 1/72', 24),
 ('2002 Yamaha YZR M1', 24),
 ('1997 BMW F650 ST', 24),
 ('1969 Dodge Charger', 24),
 ('1939 Chevrolet Deluxe Coupe', 24),
 ('1936 Chrysler Airflow', 24),
 ('1932 Model A Ford J-Coupe', 24),
 ('1917 Maxwell Touring Car', 24),
 ('1917 Grand Touring Sedan', 24),
 ('18th century schooner', 24),
 ('The USS Constitution Ship', 23),
 ('The Schooner Bluenose', 23),
 ('American Airlines: B767-300', 23),
 ('2001 Ferrari Enzo', 23),
 ('1996 Peterbilt 379 Stake Bed with Outrigger', 23),
 ('1980’s GM Manhattan Express', 23),
 ('1974 Ducati 350 Mk3 Desmo', 23),
 ('1970 Plymouth Hemi Cuda', 23),
 ('1968 Ford Mustang', 23),
 ('1958 Setra Bus', 23),
 ('1939 Cadillac Limousine', 23),
 ('1938 Cadillac V-16 Presidential Limousine', 23),
 ('1932 Alfa Romeo 8C2300 Spider Sport', 23),
 ('1930 Buick Marquette Phaeton', 23),
 ('1928 Ford Phaeton Deluxe', 23),
 ('1926 Ford Fire Engine', 23),
 ('1911 Ford Town Car', 23),
 ('The Titanic', 22),
 ('The Mayflower', 22),
 ('Diamond T620 Semi-Skirted Tanker', 22),
 ('1982 Ducati 900 Monster', 22),
 ('1982 Camaro Z28', 22),
 ('1971 Alpine Renault 1600s', 22),
 ('1969 Ford Falcon', 22),
 ('1969 Corvair Monza', 22),
 ('1968 Dodge Charger', 22),
 ('1965 Aston Martin DB5', 22),
 ('1964 Mercedes Tour Bus', 22),
 ('1962 City of Detroit Streetcar', 22),
 ('1961 Chevrolet Impala', 22),
 ('1956 Porsche 356A Coupe', 22),
 ("1950's Chicago Surface Lines Streetcar", 22),
 ('1928 British Royal Navy Airplane', 22),
 ('1904 Buick Runabout', 22),
 ('1900s Vintage Tri-Plane', 22),
 ('1999 Indy 500 Monte Carlo SS', 21),
 ('1998 Chrysler Plymouth Prowler', 21),
 ('1982 Lamborghini Diablo', 21),
 ('1982 Ducati 996 R', 21),
 ('1970 Triumph Spitfire', 21),
 ('1969 Dodge Super Bee', 21),
 ('1966 Shelby Cobra 427 S/C', 21),
 ('1962 Volkswagen Microbus', 21),
 ('1957 Vespa GS150', 21),
 ('1957 Corvette Convertible', 21),
 ('1957 Chevy Pickup', 21),
 ('1948 Porsche Type 356 Roadster', 21),
 ('1936 Mercedes Benz 500k Roadster', 21),
 ('1928 Mercedes-Benz SSK', 21),
 ('1903 Ford Model A', 21),
 ('Collectable Wooden Train', 20),
 ('1992 Porsche Cayenne Turbo Silver', 20),
 ('1976 Ford Gran Torino', 20),
 ('1970 Dodge Coronet', 20),
 ('1970 Chevy Chevelle SS 454', 20),
 ('1957 Ford Thunderbird', 20),
 ('1954 Greyhound Scenicruiser', 20),
 ('1958 Chevy Corvette Limited Edition', 19),
 ('2002 Chevy Corvette', 18),
 ('1969 Chevrolet Camaro Z28', 18),
 ('1952 Citroen-15CV', 18),
 ('1949 Jaguar XK 120', 18)]

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products Which Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [12]:
cur.execute("""SELECT DISTINCT(employeeNumber), officeCode, o.city, firstName, lastName
               FROM employees e
               JOIN offices o
               USING(officeCode)
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               WHERE productCode IN (SELECT productCode
                                            FROM products
                                            JOIN orderdetails
                                            USING(productCode)
                                            JOIN orders
                                            USING(orderNumber)
                                            GROUP BY productCode
                                            HAVING COUNT(DISTINCT customerNumber) < 20)""").fetchall()

[(1370, 4, 'Paris', 'Gerard', 'Hernandez'),
 (1501, 7, 'London', 'Larry', 'Bott'),
 (1337, 4, 'Paris', 'Loui', 'Bondur'),
 (1166, 1, 'San Francisco', 'Leslie', 'Thompson'),
 (1286, 3, 'NYC', 'Foon Yue', 'Tseng'),
 (1612, 6, 'Sydney', 'Peter', 'Marsh'),
 (1611, 6, 'Sydney', 'Andy', 'Fixter'),
 (1401, 4, 'Paris', 'Pamela', 'Castillo'),
 (1621, 5, 'Tokyo', 'Mami', 'Nishi'),
 (1323, 3, 'NYC', 'George', 'Vanauf'),
 (1165, 1, 'San Francisco', 'Leslie', 'Jennings'),
 (1702, 4, 'Paris', 'Martin', 'Gerard'),
 (1216, 2, 'Boston', 'Steve', 'Patterson'),
 (1188, 2, 'Boston', 'Julie', 'Firrelli'),
 (1504, 7, 'London', 'Barry', 'Jones')]

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit of Over 15K

In [10]:
cur.execute("""SELECT employeeNumber, firstName, lastName, COUNT(customerNumber) AS numCustomers
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               GROUP BY employeeNumber, firstName, lastName
               HAVING AVG(creditLimit) > 15000""").fetchall()

[(1165, 'Leslie', 'Jennings', 6),
 (1166, 'Leslie', 'Thompson', 6),
 (1188, 'Julie', 'Firrelli', 6),
 (1216, 'Steve', 'Patterson', 6),
 (1286, 'Foon Yue', 'Tseng', 7),
 (1323, 'George', 'Vanauf', 8),
 (1337, 'Loui', 'Bondur', 6),
 (1370, 'Gerard', 'Hernandez', 7),
 (1401, 'Pamela', 'Castillo', 10),
 (1501, 'Larry', 'Bott', 8),
 (1504, 'Barry', 'Jones', 9),
 (1611, 'Andy', 'Fixter', 5),
 (1612, 'Peter', 'Marsh', 5),
 (1621, 'Mami', 'Nishi', 5),
 (1702, 'Martin', 'Gerard', 6)]

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!